# vim: set ft=ruby:
# things I usually use, installed via (home|linux)brew
def macos?
  RUBY_PLATFORM =~ /darwin/
end

def linux?
  RUBY_PLATFORM =~ /linux/
end

# this is mostly so I can have an integration test on CI that doesn't clash
# with what's already on the macOS runner
def ci?
  ENV["CI"] == "true"
end


# brew definitions
brew "vim"
brew "ripgrep"
brew "bat"
brew "fzf"
brew "tmux"
brew "universal-ctags"
brew "gotags"
brew "fd"

# add my OSS tap
tap "mrtazz/oss"
brew "mrtazz/oss/snipple"

if macos?
  cask "1password"
  cask "1password-cli"
  cask "alfred"
  cask "alacritty"
  cask "phoenix"
  cask "qlmarkdown"
  cask "zotero"
  cask "hazel"
  cask "hiddenbar"
  # git, go, and gh are already installed on codespaces
  brew "git"
  brew "go" unless ci?
  brew "gh"

  brew "mutt"
end
