# vim: set ft=ruby:
# things I usually use, installed via (home|linux)brew
def macos?
  RUBY_PLATFORM =~ /darwin/
end

def linux?
  RUBY_PLATFORM =~ /linux/
end

# whether or not to link brew installs. This is mostly so I can have an
# integration test on CI that doesn't clash with what's already on the macOS
# runner
def link?
  ENV["CI"] != "true"
end


puts "***"
puts "ENV['CI'] is '#{ENV['CI']}'"
puts "All brew installs will be linked: #{link?}"
puts "***"


# brew definitions
brew "ripgrep"
brew "bat"
brew "fzf"
brew "tmux"
brew "universal-ctags"
brew "gotags"
brew "fd"

if macos?
  cask "1password"
  cask "1password-cli"
  cask "alfred"
  cask "iterm2"
  cask "phoenix"
  # vim, git, go, and gh are already installed on codespaces
  brew "vim"
  brew "git"
  brew "go", link: false
  brew "gh"

  brew "mutt"
end
